
//	July 2010

//	BPQ32 now reads bpqcfg.txt. This module converts it to the original binary format.

//	Based on the standalonw bpqcfg.c

/************************************************************************/
/*	CONFIG.C  Jonathan Naylor G4KLX, 19th November 1988		*/
/*									*/
/*	Program to produce configuration file for G8BPQ Network Switch	*/
/*	based on the original written in BASIC by G8BPQ.		*/
/*									*/
/*	Subsequently extended by G8BPQ					*/
/*									*/
/************************************************************************/
//
//	22/11/95 - Add second port alias for digipeating (for APRS)
//		 - Add PORTMAXDIGIS param

//	1999 - Win32 Version (but should also compile in 16 bit

//	5/12/99 - Add DLLNAME Param for ext driver

//	26/11/02 - Added AUTOSAVE

// Jan 2006

//		Add params for input and output names
//		Wait before exiting if error detected

// March 2006

//		Accept # as comment delimiter
//		Display input and output filenames
//		Wait before exit, even if ok

// March 2006 

//		Add L4APPL param

// Jan 2007

//		Remove UNPROTO
//		Add BTEXT
//		Add BCALL

// Nov 2007

//		Convert calls and APPLICATIONS string to upper case

// Jan 2008

//		Remove trailing space from UNPROTO
//		Don't warn BBSCALL etc missing if APPL1CALL etc present

// August 2008

//		Add IPGATEWAY Parameter
//		Add Port DIGIMASK Parameter

// December 2008

//		Add C_IS_CHAT Parameter

// March 2009

//		Add C style COmments (/* */ at start of line)

// August 2009

//		Add INP3 flag to locked routes

// November 2009

//		Add PROTOCOL=PACTOR or WINMOR option

//	December 2009

//		Add INP3 MAXRTT and MAXHOPS Commands

// March 2010

//		Add SIMPLE mode

// March 2010

//		Change SIMPLE mode default of Full_CTEXT to 1

// April 2010

//		Add NoKeepAlive ROUTE option

// Converted to intenal bpq32 process

// Spetember 2010

// Add option of embedded port configuration 



#define _CRT_SECURE_NO_DEPRECATE

#include <windows.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "asmstrucs.h"
#include <ctype.h>
#include <conio.h>

#define DllExport	__declspec(dllexport)

// Dummy file routines - write to buffer instead

char * Buffer;

extern char * PortConfig[34];

BOOL PortDefined[34];

char * fp2;

VOID bputc(int Ch, char * ptr)
{
	*fp2++ = Ch;
}

VOID bputi(int Ch, char * ptr);

VOID bputs(char * Val, char * ptr)
{
	int Len = strlen(Val);
	memcpy(fp2, Val, Len);
	fp2 += Len;
}

VOID bseek(char * ptr, int offset, int dummy)
{
	fp2 = Buffer + offset;
}

int btell(char * ptr)
{
	return fp2 - Buffer;
}

int WritetoConsoleLocal(char * buff);

VOID __cdecl Consoleprintf(const char * format, ...)
{
	char Mess[255];
	va_list(arglist);

	va_start(arglist, format);
	vsprintf(Mess, format, arglist);
	strcat(Mess, "\r\n");
	WritetoConsoleLocal(Mess);

	return;
}

#define ApplOffset 80000			// Applications offset in config buffer
#define InfoOffset 85000			// Infomsg offset in config buffer
#define InfoMax	2000				// Max Info 

#pragma pack(1) 

struct APPLCONFIG
{
	char Command[12];
	char CommandAlias[48];
	char ApplCall[10];
	char ApplAlias[10];
	int ApplQual;
};

struct CONFIGTABLE
{

//	CONFIGURATION DATA STRUCTURE

//	DEFINES LAYOUT OF CONFIG RECORD PRODUCED BY CONFIGURATION PROG

//	LAYOUT MUST MATCH THAT IN CONFIG.C SOURCE

	char C_NODECALL[10];		// OFFSET = 0 
	char C_NODEALIAS[10];		// OFFSET = 10
	char C_BBSCALL[10];			// OFFSET = 20
	char C_BBSALIAS[10];		// OFFSET = 30

	short C_OBSINIT;			// OFFSET = 40
	short C_OBSMIN;				// OFFSET = 42
	short C_NODESINTERVAL;		// OFFSET = 44
	short C_L3TIMETOLIVE;		// OFFSET = 46
	short C_L4RETRIES;			// OFFSET = 48
	short C_L4TIMEOUT;			// OFFSET = 50
	short C_BUFFERS;			// OFFSET = 52
	short C_PACLEN;				// OFFSET = 54
	short C_TRANSDELAY;			// OFFSET = 56
	short C_T3;					// OFFSET = 58
	short Spare1;				// OFFSET = 60
	short Spare2;				// OFFSET = 62
	short C_IDLETIME;			// OFFSET = 64
	UCHAR C_EMSFLAG;			// OFFSET = 66
	UCHAR C_LINKEDFLAG;			// OFFSET = 67
	UCHAR C_BBS;				// OFFSET = 68
	UCHAR C_NODE;				// OFFSET = 69
	UCHAR C_HOSTINTERRUPT;		// OFFSET = 70
	UCHAR C_DESQVIEW;			// OFFSET = 71
	short C_MAXLINKS;			// OFFSET = 72
	short C_MAXDESTS;
	short C_MAXNEIGHBOURS;
	short C_MAXCIRCUITS;		// 78
	UCHAR C_TNCPORTLIST[16];	// OFFSET = 80
	short C_IDINTERVAL;			// 96
	short C_FULLCTEXT;			// 98    ; SPARE (WAS DIGIFLAG)
	short C_MINQUAL;			// 100
	UCHAR C_HIDENODES;			// 102
	short C_L4DELAY;			// 103
	short C_L4WINDOW;			// 105
	short C_BTINTERVAL;			// 107
	UCHAR C_AUTOSAVE;			// 109
	UCHAR C_L4APPL;				// 110
	UCHAR C_C;					//  111 "C" = HOST Command Enabled
	UCHAR C_IP;					//  112 IP Enabled
	UCHAR C_MAXRTT;				// 113
	UCHAR C_MAXHOPS;			// 114
	UCHAR Spare[3];				// 115 NOW SPARE
	short C_BBSQUAL;			// 118
	UCHAR C_WASUNPROTO;
	UCHAR C_BTEXT[120];			// 121
	char C_VERSTRING[10];		// 241 Version String from Config File
	char Spare4[4];				// 251
	UCHAR C_VERSION;			// CONFIG PROG VERSION
};

struct PORTCONFIG
{
	short PORTNUM;
	char ID[30];			//2
	short TYPE;			// 32,
	short PROTOCOL;			// 34,
	short IOADDR;			// 36,
	short INTLEVEL;			// 38,
	short SPEED;			// 40,
	short CHANNEL;			// 42,
	short BBSFLAG;			// 44, 
	short QUALITY;			// 46, 
	short MAXFRAME;			// 48,
	short TXDELAY;			// 50,
	short SLOTTIME;			// 52, 
	short PERSIST;			// 54,

	short FULLDUP;			// 56,
	short SOFTDCD;			// 58, 
	short FRACK;			// 60, 
	short RESPTIME;			// 62,
	short RETRIES;			// 64, 

	short PACLEN;			// 66,
	short QUALADJUST;			// 68,
	UCHAR DIGIFLAG;			// 70,
	UCHAR DIGIPORT;			// 71 
	short DIGIMASK;			// 72
	short USERS;			// 74,
	short TXTAIL;			// 76
	short ALIAS_IS_BBS;			// 78
	char CWID[10];			// 80,
	char PORTCALL[10];			//  90,
	char PORTALIAS[10];			// 100,
	short L3ONLY;			//  110,
	short KISSOPTIONS;		//"112,
	short INTERLOCK;			// 114,
	short NODESPACLEN;			//  116,
	short TXPORT;			// 118,
	UCHAR MHEARD;			// 120,
	UCHAR CWIDTYPE;			// 121,
	short MINQUAL;			// 122, 
	short MAXDIGIS;			//  123,
	char DefaultNoKeepAlives; // 124
	char Pad[3];				// 127,
	char UNPROTO[72];		//  128, 
	char PORTALIAS2[10];	//    200,
	char DLLNAME[16];		//  210,
	char BCALL[10];			// 226,
	char Pad2[20];
	char VALIDCALLS[256];	//   256,
};

struct PORTCONFIG PortRec;

#pragma pack()

int tnctypes(int i, char value[],char rec[]);
int do_kiss (char value[],char rec[]);
int dec_byte(i, value, rec);

extern char PWTEXT[];
extern char LOCATOR[];
extern int AXIPPort;

extern int __cdecl main(int argc,char **argv,char **envp);
extern int __cdecl decode_rec(char *rec);
extern int __cdecl applcallsign(int i,char *value,char *rec);
extern int __cdecl appl_qual(int i,char *value,char *rec);
extern int __cdecl callsign(int i,char *value,char *rec);
extern int __cdecl int_value(int i,char *value,char *rec);
extern int __cdecl hex_value(int i,char *value,char *rec);
extern int __cdecl bin_switch(int i,char *value,char *rec);
extern int __cdecl dec_switch(int i,char *value,char *rec);
extern int __cdecl numbers(int i,char *value,char *rec);
extern int __cdecl applstrings(int i,char *value,char *rec);
extern int __cdecl dotext(int i,char *key_word, int max);
